app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("commenter", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "luis"], ["body", "luis manuel"], ["post_id", 4], ["created_at", "2015-01-19 17:51:10.565082"], ["updated_at", "2015-01-19 17:51:10.565082"]]
---
	def create
		@post = Post.find(params[:post_id])
		@comment = @post.comments.create(comment_params)