app/controllers/posts_controller.rb

def create
	@post = Post.new(post_params)

	if @post.save
---
INSERT INTO "posts" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Hola"], ["text", "Hola"], ["created_at", "2015-01-19 15:58:02.572262"], ["updated_at", "2015-01-19 15:58:02.572262"]]

def update
	@post = Post.find(params[:id])

	if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "posts" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Ruby is amazingasd"], ["text", "Rubyssas"], ["updated_at", "2015-01-19 17:51:30.457350"], ["id", 4]]